# AdvancedLossFactor Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedLossFactor Class
Members See Also
---
This class encapsulates advanced lighting loss factor calculation.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class AdvancedLossFactor : LossFactor
```

Visual Basic
---
```text
Public Class AdvancedLossFactor _
	Inherits LossFactor
```

Visual C++
---
```text
public ref class AdvancedLossFactor : public LossFactor
```

# Remarks
Advanced lighting loss factor is a combination of several different factors. Each factor has a value of 0.0 (total loss) to 1.0 (no loss).
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LossFactor Autodesk.Revit.DB.Lighting..::..AdvancedLossFactor
# See Also
AdvancedLossFactor Members
Autodesk.Revit.DB.Lighting Namespace